app/views/questions/index.html.erb

SELECT COUNT(*) FROM `questions`
SELECT `questions`.* FROM `questions` ORDER BY created_at DESC
---

<p class="muted"><%= t('.counter_questions') %> <%= pluralize @questions.count, "" %></p>