app/views/page/_posts.html.erb

<div class="counter_posts">
  <p class="muted"><%=t('page.posts')%>: <%= pluralize @posts.count, "" %> </p>
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC LIMIT 5 OFFSET 0

        <p class="text-error">
        <%= pluralize post.comments.size, ""  %> <i class=" icon-comment"></i> |
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 1