app/views/service/_comments.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1 ORDER BY created_at DESC
---
<% @post.comments.desc.each do |comment| %>