app/views/posts/index.html.erb

        <p class="text=error">
        <%= pluralize post.comments.size, ""  %> <i class=" icon-comment"></i> |
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 1