app/controllers/page_controller.rb

  def index
    @posts = Post.desc
    @posts= Post.desc.paginate(:page => params[:page], :per_page => 7)
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC LIMIT 5 OFFSET 0