app/controllers/page_controller.rb

  def help
    @title = "help"
    @posts = Post.search(params[:search])
---
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC

  def about
    @posts = Post.search(params[:search])
---
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC