app/controllers/posts_controller.rb

SELECT posts.*, COALESCE(rs_reputations.value, 0) AS votes FROM `posts` LEFT JOIN rs_reputations ON posts.id = rs_reputations.target_id AND rs_reputations.target_type = 'Post' AND rs_reputations.reputation_name = 'votes' AND rs_reputations.active = 1 ORDER BY votes desc
SELECT COUNT(*) FROM `users`
SELECT COUNT(*) FROM `posts`
---
  def index
    @posts = Post.find_with_reputation(:votes, :all, :order => "votes desc")
    @posts = Post.search(params[:search])


    @total_users = User.count
    @total_posts = Post.count

SELECT COUNT(*) FROM `users`
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def show
    @total_users = User.count
    @post = Post.find(params[:id])