app/controllers/questions_controller.rb

SELECT COUNT(*) FROM `users`
SELECT COUNT(*) FROM `questions`
---
  def index
    @questions = Question.desc
    @posts = Post.desc.paginate(:page => params[:page],  :per_page => 5)

    @total_users = User.count
    @total_questions = Question.count