app/controllers/questions_controller.rb

SELECT `questions`.* FROM `questions` ORDER BY created_at DESC
---
  def index
    @questions = Question.all