app/controllers/sessions_controller.rb

SELECT COUNT(*) FROM `users`
---
  def new
    @total_users = User.count