app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @total_users = User.count
    @user = User.find(params[:id])

SELECT COUNT(*) FROM `users`
---
  def new
    @total_users = User.count

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @total_users = User.count
    @user = User.find(params[:id])