app/views/layouts/_mini_profile.html.erb

          <i class=" icon-eye-open"> Online</i>  <br/>
          <i class="icon-comment">  <%= pluralize @user.comments.size, ""%></i><br/>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`user_id` = 1